---
kind: type
id: T:Autodesk.Revit.DB.SpacingRuleLayout
source: html/163b0cc7-31f0-68b4-ced5-bea6d3c5abcc.htm
---
# Autodesk.Revit.DB.SpacingRuleLayout

Rules for laying out a series of equidistant points or parallel lines

## Syntax (C#)
```csharp
public enum SpacingRuleLayout
```